system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;
solver 		incompressibleFluid;

startFrom       latestTime;

startTime       0;

stopAt           endTime;//writeNow //endTime

endTime            103;

deltaT          0.00001;

writeControl    runTime;

writeInterval     0.5;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
   fieldAverage1
   {
      type         fieldAverage;
      libs         ("libfieldFunctionObjects.so");
      writeControl  writeTime;
      
      fields
      (
        p
        {
        
            mean        on;
            prime2Mean  on;
            base        time;
         
         }
        U
        {
             mean    on;
             prime2Mean  on;
             base   time;
        
        }
     );
   }



}




// ************************************************************************* //
