system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;


ulip 0.0025; top 1.8975;
llip -0.0025; bot -1.8975;
length 2;
vertices
(
	(-0.0025 0.0025 0) //0
    (0 $ulip 0) //1
    (0 $top 0) //2
    ($length $top 0) //3 
    ($length $ulip 0) //4
    
    ($length 0 0)//($length $llip 0)//5
   // ($length $bot  0)//6
  //  (0 $bot 0)//7
    (0 0 0)//(0 $llip 0)//8 (6)
    (-0.0025 0 0)//9(7)
    
    (-0.0025 0.0025 0.1)//10(8)
    (0 $ulip 0.1)//11(9)
    (0 $top 0.1)//12(10)
    ($length $top 0.1)//13(11)
    ($length $ulip 0.1)//14(12)
    
    ($length 0 0.1)//($length $llip 0.1)//15(13)
  //  ($length $bot  0.1)//16
 //   (0 $bot 0.1)//17
       (0 0 0.1)   //(0 $llip 0.1)//18(14)
    (-0.0025 0 0.1)//19(15)

);


blocks
(
    hex  (1 4 3 2 9 12 11 10)(200 200 1) simpleGrading (1 10 1)//(0 3 2 1 8 11 10 9)
    hex  (6 5 4 1 14 13 12 9)(200 2 1) simpleGrading (1 1 1)//(7 4 3 0 15 12 11 8)
    //hex  (7 6 5 8 17 16 15 18)(250 200 1) simpleGrading (1 0.11 1)//(6 5 4 7 14 13 12 15)
    hex  (7 6 1 0 15 14 9 8)(2 2 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (7 15 8 0)//9 19 10 0)
        );
    }
    
    leftup
    {
        type wall;
        faces
        (
            (1 9 10 2)//(1 11 12 2)
            (0 8 9 1)// (0 10 11 1)//
        );
    }
    /*
    leftdown
    {
        type wall;
        faces
        (
            (8 7 17 18)//(7 6 14 15)
            (9 8 18 19)
        );
    }
    */
    outlet
    {
        type patch;
        faces
        (
          (12 4 3 11)// (14 4 3 13)// (11 3 2 10)
           (13 5 4 12)// (15 5 4 14)//(12 4 3 11)
          // (16 6 5 15)//(5 4 12 13)
        );
    }
    
    top
    {
        type patch;
        faces
        (
            (3 2 10 11)//(3 2 12 13)//(2 1 9 10)
        );
    }
    
    symplane
    {
        type symmetryPlane;
        faces
        (
           (6 5 13 14)// (7 6 16 17)//(6 5 13 14)
           (7 6 14 15)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (1 2 3 4)//(0 1 2 3)
            (1 4 5 6)//(1 4 5 8)//(7 0 3 4)
            //(8 5 6 7)//(7 4 5 6)
            (0 1 6 7)
            (9 12 11 10)
            (14 13 12 9)
            (15 14 9 8)
            //(11 14 13 12)//(8 11 10 9)
            //(18 15 14 11)//(15 12 11 8)
            //(16 15 18 17)//(13 12 15 14)
            //(19 18 11 10)
           // (0 1 8 9)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
