0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  
   inlet
    {
       type            fixedValue;
       value           uniform 0;
    
       
    }
    

     outlet
    { 
      
       type            fixedValue;
       value           uniform 0;
    }
    
    
  
    leftup
    {
         type            zeroGradient;
    // type          freestreamPressure;
       // freestreamValue  uniform 1e5;
    }
   /* 
    leftdown
    {
          type            zeroGradient;
      // type          freestreamPressure;
     //   freestreamValue  uniform 1e5;
    }*/
    top
    {
         type            zeroGradient;
     
    }
    symplane
    {
      type            symmetryPlane;//zeroGradient;
     
        
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //

