0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.670268;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.670268;
    }
    outlet
    {
        type            zeroGradient;
    }
    leftup
    {
        type            epsilonWallFunction;
        value           uniform 0.670268;
    }
  /*  leftdown
    {
        type            epsilonWallFunction;
        value           uniform 0.670268;
    }*/
    top
    {
        type            zeroGradient;
    }
    symplane
    {
        type            symmetryPlane;//zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}
// ************************************************************************* //
