0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10.095592
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0.095592";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.095592;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0.095592;
    }
    outlet
    {
        type            calculated;
        value		 uniform 0.095592;
    }
    leftup
    {
        type            nutkWallFunction;
        value           uniform 0.095592;
    }
   /* leftdown
    {
        type            nutkWallFunction;
        value           uniform 0.095592;
    }*/
    top
    {
        type            calculated;
        value           uniform 0.095592;
    }
    symplane
    {
      //type            calculated;
       // value           uniform 0.095592;
       type  symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
